{
  "en": {
    "home": "Home",
    "about": "About",
    "services": "Services",
    "contact": "Contact us",
    "login": "Log in",
    "signup": "Sign up",
    "chooselang": "Choose a language",
    "welcome": "Welcome to petcare.uz",
    "description": "Your trusted partner in pet adoption, rehoming, shopping, and vet care—bringing love, joy, and wellness to every pet and their family.",
    "about_headline": "About petcare.uz",
    "about_description": "At petcare.uz, we’re passionate about pets and the people who love them, delivering a seamless experience for adoption, supplies, and care.",
    "whoWeAre": "Who we are",
    "whoWeAreDsc": "We are a team of animal enthusiasts building a community where pets and their families thrive.",
    "whatWeDo": "What we do",
    "whatWeDoDsc": "We connect pets with homes, sell quality pet products, and offer expert vet services—all in one place.",
    "howWeHelp": "How we help",
    "howWeHelpDsc": "We simplify adoption and rehoming, provide essentials, and ensure pets stay healthy with trusted care.",
    "whyChooseUs": "Why choose us",
    "whyChooseUsDsc": "With compassion, convenience, and a love for pets, we’re your go-to for everything pet-related.",
    "services_headline": "Our services",
    "services_description": "Discover everything your pet needs in one place—whether it’s finding a furry friend, giving a pet a new home, shopping for essentials, or booking expert care, we’re here to make every moment with your pet special.",
    "adoptAPet": "Adopt a pet",
    "adoptAPetBody": "Find your perfect companion from our curated list of adoptable pets, ready to bring joy to your home.",
    "btnMeetYourPet": "Meet your pet",
    "rehomeAPet": "Rehome a pet",
    "rehomeAPetBody": "Give a pet a new loving home with our easy rehoming process, connecting pets with caring families.",
    "btnStartRehoming": "Start rehoming",
    "petShop": "Pet shop",
    "petShopBody": "Shop quality food, toys, and accessories to keep your pet happy and healthy, all in one convenient spot.",
    "btnBrowseProducts": "Browse products",
    "vetService": "Vet service",
    "vetServiceBody": "Access trusted veterinary care, from routine check-ups to emergencies, ensuring your pet’s lifelong well-being.",
    "btnBookAVisit": "Book a visit",
    "footerLogoText": "From Adoption to Vet Care – We’ve Got It Covered",
    "supportWord": "Support:",
    "followUsAt": "Follow us at:",
    "formTitle": "Log In"
  },
  "ru": {
    "home": "Главная",
    "about": "О нас",
    "services": "Наши сервисы",
    "contact": "Контакт",
    "login": "Войти",
    "signup": "Зарегистрироваться",
    "chooselang": "Выберите язык",
    "welcome": "Добро пожаловать в petcare.uz",
    "description": "Ваш надежный партнер в вопросах усыновления домашних животных, поиска новых хозяев, покупок и ветеринарной помощи, приносящий любовь, радость и благополучие каждому питомцу и его семье.",
    "about_headline": "О petcare.uz",
    "about_description": "В petcare.uz мы с энтузиазмом относимся к домашним животным и людям, которые их любят, и обеспечиваем беспроблемный процесс усыновления, снабжения и ухода.",
    "whoWeAre": "Кто мы",
    "whoWeAreDsc": "Мы — команда, объединённая любовью к животным, которая строит сообщество для их счастья и благополучия.",
    "whatWeDo": "Что мы делаем",
    "whatWeDoDsc": "Мы помогаем домашним животным найти дом, продаем качественные товары для животных и предлагаем услуги профессиональных ветеринаров — все в одном месте.",
    "howWeHelp": "Как мы помогаем",
    "howWeHelpDsc": "Мы упрощаем процесс усыновления и переселения, обеспечиваем всем необходимым и гарантируем здоровье питомцев благодаря надежному уходу.",
    "whyChooseUs": "Почему выбрать нас",
    "whyChooseUsDsc": "Благодаря состраданию, удобству и любви к домашним животным мы — ваш надежный партнер по всем вопросам, связанным с домашними животными.",
    "services_headline": "Наши услуги",
    "services_description": "Найдите все, что нужно вашему питомцу, в одном месте — будь то поиск пушистого друга, поиск нового дома для питомца, покупка предметов первой необходимости или заказ профессиональной помощи — мы здесь, чтобы сделать каждый момент с вашим питомцем особенным.",
    "adoptAPet": "Усыновление",
    "adoptAPetBody": "Найдите идеального спутника из нашего тщательно подобранного списка питомцев, готовых принести радость в ваш дом.",
    "btnMeetYourPet": "Усыновить питомца",
    "rehomeAPet": "Передать питомца",
    "rehomeAPetBody": "Дайте питомцу новый любящий дом с помощью нашего простого процесса передачи, соединяя питомцев с заботливыми семьями.",
    "btnStartRehoming": "Передать питомца",
    "petShop": "Зоомагазин",
    "petShopBody": "Покупайте качественный корм, игрушки и аксессуары, чтобы ваш питомец был счастлив и здоров, всё в одном месте.",
    "btnBrowseProducts": "Посмотреть товары",
    "vetService": "Ветеринар",
    "vetServiceBody": "Получите надежный ветеринарный уход, от осмотров до экстренных случаев, обеспечивая благополучие вашего питомца.",
    "btnBookAVisit": "Записаться на прием",
    "footerLogoText": "От усыновления до ветеринарной помощи — у нас есть все",
    "supportWord": "Служба поддержки:",
    "followUsAt": "Подпишитесь на нас:",
    "formTitle": "Вход"
  },
  "uz": {
    "home": "Asosiy",
    "about": "Biz haqimizda",
    "services": "Xizmatlar",
    "contact": "Aloqa",
    "login": "Kirish",
    "signup": "Ro'yxatdan o'tish",
    "chooselang": "Tilni tanlang",
    "welcome": "petcare.uzga xush kelibsiz",
    "description": "Uy hayvonlarini boqib olish, uy hayvonlari uchun yangi uy topish, uy hayvonlari maxsulorlarini xarid qilish va veterinar xizmatlari bo'yicha ishonchli hamkoringiz.",
    "about_headline": "petcare.uz haqida",
    "about_description": "petcare.us saytida biz uy hayvonlari va ularni sevadigan odamlarga asrab olish, qayta joylashtirish va parvarish qilish bo‘yicha uzluksiz tajriba taqdim etamiz.",
    "whoWeAre": "Biz kimmiz",
    "whoWeAreDsc": "Biz hayvonlarni sevadigan jamoamiz, ularning baxti va farovonligi uchun birlashganmiz.",
    "whatWeDo": "Biz nima qilamiz",
    "whatWeDoDsc": "Biz uy hayvonlariga uy topishga yordam beramiz, uy hayvonlari uchun sifatli mahsulotlar sotamiz va mutaxassis veterinar xizmatlarini taklif qilamiz - barchasi bir joyda.",
    "howWeHelp": "Biz qanday yordam beramiz",
    "howWeHelpDsc": "Biz uy hayvoni boqib olish va uni boshqa uyga berish jarayonini osonlashtiramiz, zarur narsalar va ishonchli parvarish bilan ta'minlaymiz.",
    "whyChooseUs": "Nima uchun bizni tanlash kerak",
    "whyChooseUsDsc": "Biz sizning uy hayvonlaringizga bo'lgan barcha ehtiyojlaringiz uchun ishonchli hamkormiz",
    "services_headline": "Bizning xizmatlar",
    "services_description": "Uy hayvoningizga kerak bo'lgan hamma narsani bir joyda toping - biz sizga yangi uy hayvoni topish, uy hayvoningiz uchun yangi uy hayvoni topishga, ular uchun zarur narsalarni xarid qilish yoki professional yordamni bron qilish uchun yordam beramiz. Biz uy hayvoningizga kerakli barcha narsa bilan ta'minlash uchun shu yerdamiz.",
    "adoptAPet": "Boqib olish",
    "adoptAPetBody": "Bizning tanlangan asrab olinadigan uy hayvonlari ro‘yxatidan o'zingizga yoqqan hamrohingizni toping, ular uyingizga quvonch keltirishga tayyor.",
    "btnMeetYourPet": "Ro'yxatga o'tish",
    "rehomeAPet": "Qayta joylashtirish",
    "rehomeAPetBody": "Bizning oson qayta joylashtirish jarayonimiz bilan uy hayvoniga yangi mehribon uy topib, hayvonlarni g‘amxo‘r oilalar bilan bog‘laymiz.",
    "btnStartRehoming": "Qayta joylashtirish",
    "petShop": "Zoomagazin",
    "petShopBody": "Uy hayvoningizni baxtli va sog‘lom saqlash uchun sifatli oziq-ovqat, o‘yinchoqlar va aksessuarlarni bir joydan xarid qiling.",
    "btnBrowseProducts": "Mahsulotlarni ko'rish",
    "vetService": "Veterinar xizmati",
    "vetServiceBody": "Tekshiruvlardan tortib favqulodda holatlargacha ishonchli veterinariya xizmatidan foydalaning, uy hayvoningiz salomatligini ta’minlaymiz.",
    "btnBookAVisit": "Qabulga yozilish",
    "footerLogoText": "Uy hayvonlarini boqib olishdan tortib veterinar xizmatigacha - bizda hammasi bor",
    "supportWord": "Savollar uchun:",
    "followUsAt": "Bizga obuna bo'ling:",
    "formTitle": "Kirish"
  },
  "comment": {
    "formTitle": "Log In",
    "submitBtn": "Log In",
    "googleLogin": "Log In with Google",
    "errorMsg": "Invalid email or password",
    "toggleText": "Don't have and account?",
    "toggleLink": "Sign Up"
  }
}
